Repository: kesslermatics/Aquaware
Catalog: App/lib/l10n/app_*.arb
Languages: de

source: Welcome to Aquaware
de: Willkommen bei Aquaware

# chooseLanguage
source: Let’s set your language first.
de: Lass uns zuerst deine Sprache einstellen.

source: Smart and Efficient
de: Intelligent und Effizient

# uploadParameters
source: Upload your water parameters quickly and easily.
de: Lade deine Wasserparameter schnell und einfach hoch.

# visualizeAndControl
source: Visualize and Take Control
de: Visualisieren und Steuern

# getStarted
source: Dive into insights and manage your aquarium like a pro!
de: Tauche ein und manage dein Aquarium wie ein Profi!

source: Skip
de: Überspringen

source: Error
de: Fehler

source: Success
de: Erfolg

# errorTitle
source: Error
de: Fehler

# emailPasswordEmpty
source: Email or password cannot be empty.
de: E-Mail oder Passwort dürfen nicht leer sein.

# signingInTitle
source: Signing In
de: Einloggen

# signingInMessage
source: Please wait...
de: Bitte warten...

# successTitle
source: Success
de: Erfolg

# signInSuccessMessage
source: Signed in successfully!
de: Erfolgreich eingeloggt!

# cancelledTitle
source: Cancelled
de: Abgebrochen

# googleSignInCancelledMessage
source: Google Sign-In was cancelled!
de: Google-Anmeldung wurde abgebrochen!

# googleSignInSuccessMessage
source: Signed in with Google successfully!
de: Erfolgreich mit Google angemeldet!

# googleSignInErrorMessage
source: Google Sign-In failed: Please try again later!
de: Google-Anmeldung fehlgeschlagen: Bitte später erneut versuchen!

# forgotPasswordTitle
source: Forgot Password
de: Passwort vergessen

# forgotPasswordMessage
source: Enter your email address to receive a reset code.
de: Gib deine E-Mail-Adresse ein, um einen Reset-Code zu erhalten.

# emailFieldLabel
source: Email Address
de: E-Mail-Adresse

source: Cancel
de: Abbrechen

source: Send Code
de: Code senden

# pleaseWaitTitle
source: Please Wait
de: Bitte warten

# codeBeingSentMessage
source: Code is being sent...
de: Code wird gesendet...

# forgotPasswordErrorMessage
source: Failed to send code. Please check your email address and try again.
de: Code konnte nicht gesendet werden. Bitte überprüfe deine E-Mail-Adresse und versuche es erneut.

# resetPasswordTitle
source: Reset Password
de: Passwort zurücksetzen

# resetPasswordMessage
source: Enter the reset code sent to your email and set a new password.
de: Gib den an deine E-Mail gesendeten Code ein und lege ein neues Passwort fest.

# newPasswordFieldLabel
source: New Password
de: Neues Passwort

# resetPasswordButton
source: Reset Password
de: Passwort zurücksetzen

# resetPasswordEmptyFieldsError
source: Please provide both the reset code and a new password.
de: Bitte gib sowohl den Reset-Code als auch ein neues Passwort ein.

# resettingPasswordMessage
source: Resetting your password...
de: Passwort wird zurückgesetzt...

# resetPasswordSuccessMessage
source: Your password has been reset successfully!
de: Dein Passwort wurde erfolgreich zurückgesetzt!

# loginFailedTitle
source: Login Failed
de: Login fehlgeschlagen

# loginFailedMessage
source: Your password was reset, but login failed. Please try again.
de: Dein Passwort wurde zurückgesetzt, aber der Login ist fehlgeschlagen. Bitte versuche es erneut.

# resetPasswordErrorMessage
source: Failed to reset password. Please check the reset code and try again.
de: Passwort konnte nicht zurückgesetzt werden. Bitte überprüfe den Reset-Code und versuche es erneut.

source: Welcome,
de: Willkommen,

# welcomeDescription
source: Explore and manage your water quality effortlessly
de: Erkunde und verwalte die Wasserqualität mühelos

source: Password
de: Passwort

source: Remember Me
de: Angemeldet bleiben

source: Forgot Password
de: Passwort vergessen

source: Sign In
de: Anmelden

source: Create Account
de: Konto erstellen

source: Sign in with Google
de: Mit Google anmelden

# acceptTerms
source: Please accept the Terms and Conditions.
de: Bitte akzeptiere die Allgemeinen Geschäftsbedingungen.

source: Passwords do not match.
de: Passwörter stimmen nicht überein.

# accountCreated
source: Account created successfully!
de: Konto erfolgreich erstellt!

source: Cancelled
de: Abgebrochen

# googleSignUpCancelled
source: Google Sign-Up was cancelled!
de: Google-Anmeldung wurde abgebrochen!

# googleSignUpSuccess
source: Signed up with Google successfully!
de: Erfolgreich mit Google angemeldet!

# googleSignUpFailed
source: Google Sign-Up failed: {error}
de: Google-Anmeldung fehlgeschlagen: {error}

# urlLaunchFailed
source: Could not launch URL: {url}
de: URL konnte nicht geöffnet werden: {url}

# createAccountTitle
source: Let us create an account for you!
de: Lass uns ein Konto für dich erstellen!

source: First Name
de: Vorname

source: Last Name
de: Nachname

source: Repeat Password
de: Passwort wiederholen

# agreeTerms
source: I agree to the Terms and Conditions
de: Ich stimme den Nutzungsbedingungen zu

source: Or
de: Oder

source: Sign up with Google
de: Mit Google registrieren

# fetchProfileError
source: Failed to fetch user profile. Please try again.
de: Benutzerprofil konnte nicht abgerufen werden. Bitte versuche es erneut.

# updateProfileError
source: Failed to update profile. Please try again.
de: Profil konnte nicht aktualisiert werden. Bitte versuche es erneut.

# profileUpdated
source: Profile updated successfully.
de: Profil erfolgreich aktualisiert.

# apiKeyRegenerated
source: API Key regenerated successfully.
de: API-Schlüssel erfolgreich neu generiert.

# regenerateApiKeyError
source: Failed to regenerate API Key. Please try again.
de: API-Schlüssel konnte nicht neu generiert werden. Bitte versuche es erneut.

# accountDeleted
source: Account deleted successfully.
de: Konto erfolgreich gelöscht.

# deleteAccountError
source: Failed to delete account. Please try again.
de: Konto konnte nicht gelöscht werden. Bitte versuche es erneut.

source: Regenerate API Key
de: API-Schlüssel neu generieren

# regenerateApiKeyMessage
source: Regenerating your API key will revoke the old key, and any devices using it will need to be updated with the new key. Are you sure you want to continue?
de: Das Neugenerieren deines API-Schlüssels widerruft den alten Schlüssel, und alle Geräte, die diesen verwenden, müssen mit dem neuen Schlüssel aktualisiert werden. Bist du sicher, dass du fortfahren möchtest?

source: Delete Account
de: Konto löschen

# deleteAccountMessage
source: This action is irreversible. Please confirm your email, password, and enter 'DELETE ACCOUNT' to proceed.
de: Diese Aktion ist irreversibel. Bitte bestätige deine E-Mail-Adresse, dein Passwort und gib 'DELETE ACCOUNT' ein, um fortzufahren.

source: Regenerate
de: Neu generieren

# enterDeleteAccountText
source: Enter 'DELETE ACCOUNT'
de: Gib 'DELETE ACCOUNT' ein

# deleteAccountError2
source: You must enter 'DELETE ACCOUNT' exactly.
de: Du musst genau 'DELETE ACCOUNT' eingeben.

source: Delete
de: Löschen

# firstNameFieldLabel
source: First Name
de: Vorname

# lastNameFieldLabel
source: Last Name
de: Nachname

# subscriptionTierFieldLabel
source: Subscription Tier
de: Abonnementstufe

# dateJoinedFieldLabel
source: Date Joined
de: Beitrittsdatum

# apiKeyFieldLabel
source: API Key
de: API-Schlüssel

# regenerateApiKeyButton
source: Regenerate API Key
de: API-Schlüssel neu generieren

# updateProfileButton
source: Update Profile
de: Profil aktualisieren

# deleteAccountButton
source: Delete Account
de: Konto löschen

# privacyTitle
source: 🔐 Data Privacy and AI Training
de: 🔐 Datenschutz und KI-Training

# privacyIntro
source: At Aquaware, your privacy is our top priority. The water quality data you upload through the app is used to improve our services and enhance the accuracy of our AI predictions. However, rest assured that all data utilized for AI training and analysis is fully anonymized.
de: Bei Aquaware hat der Schutz deiner Daten oberste Priorität. Die Wasserqualitätsdaten, die du über die App hochlädst, werden genutzt, um unsere Dienste zu verbessern und die Genauigkeit unserer KI-Vorhersagen zu erhöhen. Sei jedoch versichert, dass alle Daten für das KI-Training und die Analyse vollständig anonymisiert sind.

# privacyThisMeans
source: This means:
de: Das bedeutet:

# privacyNoIdentifiers
source: • No personal identifiers: Your personal information is never tied to the data used for AI training.
de: • Keine persönlichen Kennungen: Deine persönlichen Informationen werden niemals mit den Daten verknüpft, die für das KI-Training verwendet werden.

# privacyAnonymized
source: • Anonymized data sets: The data sets we use are scrubbed of any details that could link the information back to you.
de: • Anonymisierte Datensätze: Die von uns verwendeten Datensätze sind frei von Details, die auf dich zurückgeführt werden könnten.

# privacyNonTraceable
source: • Non-traceable: The information used in AI models and predictions is designed to be non-traceable, ensuring complete anonymity.
de: • Nicht nachvollziehbar: Die in KI-Modellen und Vorhersagen verwendeten Informationen sind so gestaltet, dass sie vollständig anonym bleiben.

# privacyImprovement
source: This approach allows us to continually improve our AI models, providing better predictions and analyses, while maintaining your privacy.
de: Dieser Ansatz ermöglicht es uns, unsere KI-Modelle kontinuierlich zu verbessern und genauere Vorhersagen und Analysen bereitzustellen, während deine Privatsphäre gewahrt bleibt.

# privacyFutureFeatures
source: As our AI functionalities are further developed and tested, these advanced features, including specific water quality analysis and AI-driven predictions, will be available as premium services. Until then, you can enjoy the basic features of the Aquaware app, including data uploads and essential analyses, for free.
de: Während unsere KI-Funktionen weiterentwickelt und getestet werden, stehen diese erweiterten Funktionen, einschließlich spezifischer Wasserqualitätsanalysen und KI-gestützter Vorhersagen, als Premium-Dienste zur Verfügung. Bis dahin kannst du die grundlegenden Funktionen der Aquaware-App, einschließlich Daten-Uploads und grundlegender Analysen, kostenlos nutzen.

# communityIntro
source: Join our vibrant community of aquarium enthusiasts. Share tips, ask questions, and get support directly from the Aquaware team. We're here to help you create the best possible environment for your aquatic life.
de: Werde Teil unserer lebendigen Gemeinschaft von Aquaristik-Enthusiasten. Teile Tipps, stelle Fragen und erhalte Unterstützung direkt vom Aquaware-Team. Wir helfen dir, die bestmögliche Umgebung für dein Wasserleben zu schaffen.

# communityVisitGitHub
source: Just visit the Aquaware GitHub Repository for more information.
de: Besuche einfach das Aquaware GitHub Repository für weitere Informationen.

# communityDocumentation
source: • Documentation: Our API documentation for all types of requests.
de: • Dokumentation: Unsere API-Dokumentation für alle Arten von Anfragen.

# communitySupport
source: • Support: Open a new issue in the repository and we will look into it.
de: • Support: Öffne ein neues Issue im Repository und wir kümmern uns darum.

# communityDiscussions
source: • Discussions: Connect with other Aquaware users in the discussions tab.
de: • Diskussionen: Vernetze dich mit anderen Aquaware-Nutzern im Diskussionstab.

# communityEnjoy
source: We hope you enjoy using Aquaware and look forward to helping you create the perfect environment for your aquatic life!
de: Wir hoffen, du genießt die Nutzung von Aquaware und freuen uns darauf, dir zu helfen, die perfekte Umgebung für dein Wasserleben zu schaffen!

# drawerDashboard
source: Dashboard
de: Übersicht

# drawerAnimalDetection
source: Animal Detection
de: Tiererkennung

# drawerDiseaseDetection
source: Disease Detection
de: Krankheitserkennung

# drawerProfile
source: Profile
de: Profil

# drawerPrivacy
source: Privacy
de: Datenschutz

# drawerSendFeedback
source: Send Feedback
de: Feedback senden

# drawerAbout
source: About
de: Über uns

# logoutConfirmTitle
source: Confirm Logout
de: Abmeldung bestätigen

# logoutConfirmMessage
source: Are you sure you want to logout? You will need to sign in again to access your account.
de: Möchtest du dich wirklich abmelden? Du musst dich erneut anmelden, um auf dein Konto zuzugreifen.

source: Yes
de: Ja

source: No
de: Nein

# dashboardTitle
source: Dashboard
de: Übersicht

# animalDetectionTitle
source: Animal Detection
de: Tiererkennung

# diseaseDetectionTitle
source: Disease Detection
de: Krankheitserkennung

# profileTitle
source: Profile
de: Profil

# feedbackTitle
source: Send Feedback
de: Feedback senden

# aboutTitle
source: About
de: Über uns

# feedbackTitleLabel
source: Title
de: Titel

# feedbackMessageLabel
source: Message
de: Nachricht

# feedbackTitleValidation
source: Please enter a title
de: Bitte gib einen Titel ein

# feedbackMessageValidation
source: Please enter a message
de: Bitte gib eine Nachricht ein

# sendFeedbackButton
source: Send Feedback
de: Feedback senden

# feedbackSuccessTitle
source: Success
de: Erfolg

# feedbackSuccessMessage
source: Feedback sent successfully!
de: Feedback erfolgreich gesendet!

# feedbackErrorTitle
source: Error
de: Fehler

# feedbackErrorMessage
source: Failed to send feedback. Please try again.
de: Feedback konnte nicht gesendet werden. Bitte versuche es erneut.

# uploadOrCaptureImage
source: Upload or capture an image of the aquatic animal to analyze its health.
de: Lade ein Bild des Wassertiers hoch oder mache ein Foto, um seine Gesundheit zu analysieren.

source: Upload Image
de: Bild hochladen

source: Capture Image
de: Bild aufnehmen

source: Analyze
de: Analysieren

source: Analyzing Image
de: Bild wird analysiert

# pleaseWait
source: Please wait while we analyze the image.
de: Bitte warte, während wir das Bild analysieren.

# noAnimalDetected
source: No aquatic animal was found in this image.
de: Kein Wassertier wurde in diesem Bild gefunden.

# errorPickingImage
source: Error picking image: {error}
de: Fehler beim Auswählen des Bildes: {error}

# errorCapturingImage
source: Error capturing image: {error}
de: Fehler beim Aufnehmen des Bildes: {error}

# errorAnalyzingImage
source: Error analyzing image: {error}
de: Fehler bei der Bildanalyse: {error}

# uploadOrCaptureImageFirst
source: Please upload or capture an image first.
de: Bitte lade zuerst ein Bild hoch oder mache ein Foto.

# lockedFeatureMessage
source: This feature is available only in the Advanced or Business Plan.
de: Diese Funktion ist nur im Advanced- oder Business-Plan verfügbar.

source: Disease Diagnosis Result
de: Diagnoseergebnis der Krankheit

# healthyAnimalMessage
source: The captured animal seems to be healthy!
de: Das Tier scheint gesund zu sein!

source: Condition
de: Zustand

source: Symptoms
de: Symptome

source: Suggested Treatment
de: Vorgeschlagene Behandlung

# keepInMindDetails
source: Please note that this API uses machine learning models to analyze the animal and its condition. While it is generally accurate, there may be edge cases where: • Symptoms of disease are subtle or not easily detectable. • The animal’s natural patterns or appearance may resemble disease symptoms but are not harmful. The diagnosis provided should be taken as a recommendation, not a definitive conclusion. No liability will be accepted for any incorrect diagnosis or subsequent actions taken based on the response. It is always recommended to consult a professional veterinarian or animal health expert for any serious concerns about your pets.
de: Bitte beachte, dass diese API maschinelle Lernmodelle verwendet, um das Tier und seinen Zustand zu analysieren. Obwohl sie im Allgemeinen genau ist, kann es Randfälle geben, bei denen: • Symptome der Krankheit subtil oder schwer erkennbar sind. • Die natürlichen Muster oder das Aussehen des Tieres Krankheitssymptomen ähneln, aber nicht schädlich sind. Die bereitgestellte Diagnose sollte als Empfehlung und nicht als endgültige Schlussfolgerung betrachtet werden. Es wird keine Haftung für falsche Diagnosen oder daraus resultierende Handlungen übernommen. Es wird stets empfohlen, bei ernsthaften Bedenken einen professionellen Tierarzt oder Tiergesundheitsexperten zu konsultieren.

# uploadOrCaptureToIdentify
source: Upload or capture an image of the aquatic animal to identify its species.
de: Lade ein Bild des Wassertiers hoch oder fotografiere es, um die Art zu identifizieren.

# featureLockedMessage
source: This feature is available only in the Advanced or Business Plan.
de: Diese Funktion ist nur im Advanced- oder Business-Plan verfügbar.

# pleaseWaitAnalyze
source: Please wait while we analyze the image.
de: Bitte warten, während wir das Bild analysieren.

# detectedAnimalInfo
source: Detected Animal Information
de: Erkannte Tierinformationen

source: Habitat
de: Lebensraum

source: Average Size
de: Durchschnittliche Größe

source: Lifespan
de: Lebensspanne

source: Visual Characteristics
de: Visuelle Merkmale

source: Behavior
de: Verhalten

source: Diet
de: Ernährung

source: ⚠️ Keep in Mind
de: ⚠️ Beachte

# admonitionContent
source: Please note that this API uses machine learning models to analyze the species. While it is generally accurate, there may be edge cases where: • Species identification may not be perfect, especially if the image quality is low. • Visual characteristics of certain species may overlap, leading to misidentification. The species identification provided should be taken as a recommendation, not a definitive conclusion. No liability will be accepted for any incorrect identification or subsequent actions taken based on the response.
de: Bitte beachte, dass diese API maschinelle Lernmodelle verwendet, um die Arten zu analysieren. Obwohl sie im Allgemeinen genau ist, kann es zu Ausnahmefällen kommen, bei denen: • Die Artenbestimmung möglicherweise nicht perfekt ist, insbesondere wenn die Bildqualität niedrig ist. • Visuelle Merkmale bestimmter Arten sich überschneiden können, was zu Fehlidentifikationen führt. Die bereitgestellte Artenbestimmung sollte als Empfehlung und nicht als endgültige Schlussfolgerung betrachtet werden. Es wird keine Haftung für fehlerhafte Identifikationen oder daraus resultierende Maßnahmen übernommen.

# tutorialWelcomeTitle
source: Welcome to Aquaware
de: Willkommen bei Aquaware

# tutorialWelcomeContent
source: Aquaware is your ultimate solution for water monitoring. Whether you're managing an aquarium, pond, or any water body, Aquaware provides you with powerful tools to track water quality effortlessly. I'm Robert, the creator of Aquaware. This app is designed to make water management simple, accessible, and even a bit fun!
de: Aquaware ist deine ultimative Lösung für die Wasserüberwachung. Egal, ob du ein Aquarium, einen Teich oder ein anderes Gewässer verwaltest, Aquaware bietet dir leistungsstarke Werkzeuge, um die Wasserqualität mühelos zu überwachen. Ich bin Robert, der Ersteller von Aquaware. Diese App wurde entwickelt, um Wassermanagement einfach, zugänglich und sogar ein wenig unterhaltsam zu machen!

# tutorialAppFeaturesTitle
source: What the App Can Do
de: Was die App kann

# tutorialAppFeaturesContent
source: With Aquaware, you can monitor water parameters, visualize data in real-time, and get personalized insights. It's your companion for ensuring the health and quality of your aquatic environments. Whether you're a hobbyist or a professional, Aquaware makes it easy.
de: Mit Aquaware kannst du Wasserparameter überwachen, Daten in Echtzeit visualisieren und personalisierte Einblicke erhalten. Es ist dein Begleiter, um die Gesundheit und Qualität deiner aquatischen Umgebungen zu gewährleisten. Egal ob Hobbyist oder Profi, Aquaware macht es einfach.

# tutorialEnvironmentsTitle
source: Understanding Environments
de: Umgebungen verstehen

# tutorialEnvironmentsContent
source: An environment in Aquaware represents a water body, like an aquarium, pond, or lake. You can create an environment by tapping the '+' icon on the dashboard. Public environments are also available if shared by others. All water values for an environment are stored and visualized for easy monitoring.
de: Eine Umgebung in Aquaware stellt ein Gewässer dar, wie ein Aquarium, einen Teich oder einen See. Du kannst eine Umgebung erstellen, indem du auf das '+'-Symbol im Dashboard tippst. Es sind auch öffentliche Umgebungen verfügbar, wenn sie von anderen geteilt werden. Alle Wasserwerte einer Umgebung werden gespeichert und für eine einfache Überwachung visualisiert.

# tutorialAddWaterParametersTitle
source: Adding Water Parameters
de: Wasserparameter hinzufügen

# tutorialAddWaterParametersContent
source: To add water parameters, you'll need a microcontroller like an Arduino with a WiFi module and sensors for temperature, pH, or other parameters. Simply read the sensor values and upload them. For a detailed guide, visit our documentation: https://docs.aquaware.cloud/docs/getting-started/adding-water-values
de: Um Wasserparameter hinzuzufügen, benötigst du einen Mikrocontroller wie ein Arduino mit einem WiFi-Modul und Sensoren für Temperatur, pH-Wert oder andere Parameter. Lies einfach die Sensordaten aus und lade sie hoch. Für eine detaillierte Anleitung besuche unsere Dokumentation: https://docs.aquaware.cloud/docs/getting-started/adding-water-values

# tutorialSubscriptionPlansTitle
source: Subscription Plans
de: Abonnementpläne

# tutorialSubscriptionPlansContent
source: Aquaware offers three subscription plans tailored to your needs: **Hobby Plan**: - Free for personal use. - Monitor all parameters. - Upload values every 12 hours. **Advanced Plan**: - More precise tracking with uploads every 3 hours. - Alerts for specific parameters. **Premium Plan**: - Upload values every 30 minutes. - Unlimited environments. - AI-based fish identification and disease detection.
de: Aquaware bietet drei auf deine Bedürfnisse zugeschnittene Abonnementpläne: **Hobby-Plan**: - Kostenlos für den persönlichen Gebrauch. - Überwachung aller Parameter. - Werte alle 12 Stunden hochladen. **Erweiterter Plan**: - Präzisere Verfolgung mit Uploads alle 3 Stunden. - Warnungen für spezifische Parameter. **Premium-Plan**: - Werte alle 30 Minuten hochladen. - Unbegrenzte Umgebungen. - KI-basierte Fischidentifikation und Krankheitsdiagnose.

# tutorialThankYouTitle
source: Thank You!
de: Danke!

# tutorialThankYouContent
source: Thank you for choosing Aquaware as your water monitoring solution. Your trust and support mean the world to me. Aquaware was created to make water management simple, accessible, and effective. We're thrilled to have you in our growing community and are here to support you every step of the way.
de: Danke, dass du Aquaware als deine Lösung zur Wasserüberwachung gewählt hast. Dein Vertrauen und deine Unterstützung bedeuten mir die Welt. Aquaware wurde entwickelt, um Wassermanagement einfach, zugänglich und effektiv zu machen. Wir freuen uns, dich in unserer wachsenden Gemeinschaft willkommen zu heißen, und sind hier, um dich bei jedem Schritt zu unterstützen.

# publicEnvironmentsTitle
source: Public Environments
de: Öffentliche Umgebungen

# searchEnvironmentsLabel
source: Search Environments
de: Umgebungen suchen

source: No public environments found.
de: Keine öffentlichen Umgebungen gefunden.

# errorFetchingEnvironments
source: Error fetching public environments: {error}
de: Fehler beim Abrufen öffentlicher Umgebungen: {error}

# subscriptionSuccess
source: Successfully subscribed!
de: Erfolgreich abonniert!

# subscriptionFailed
source: Failed to subscribe: {error}
de: Abonnement fehlgeschlagen: {error}

# alertSettingsLoadError
source: Failed to load alert settings: {error}
de: Fehler beim Laden der Alarmeinstellungen: {error}

# alertSaved
source: Alert settings saved.
de: Alarmeinstellungen gespeichert.
