Repository: kesslermatics/Aquaware
Catalog: App/lib/l10n/app_*.arb
Languages: de

# alertSaveError
source: Failed to save alert settings: {error}
de: Fehler beim Speichern der Alarmeinstellungen: {error}

# alertNotifyEmail
source: Notify me per E-Mail when...
de: Benachrichtige mich per E-Mail, wenn...

source: is under
de: unter

source: is above
de: über

source: Save
de: Speichern

# missingInfoTitle
source: Missing Information
de: Fehlende Informationen

# missingInfoMessage
source: Please fill out all required fields.
de: Bitte fülle alle erforderlichen Felder aus.

# environmentCreated
source: Environment "{name}" created successfully.
de: Umgebung "{name}" erfolgreich erstellt.

# environmentCreateError
source: Failed to create environment: {error}
de: Fehler beim Erstellen der Umgebung: {error}

# addEnvironment
source: Add New Environment
de: Neue Umgebung hinzufügen

source: Description
de: Beschreibung

source: City
de: Stadt

source: Environment Type
de: Umgebungstyp

source: Create Environment
de: Umgebung erstellen

# deleteEnvironmentTitle
source: Delete Environment
de: Umgebung löschen

# deleteEnvironmentPrompt
source: Please enter the name of the environment to confirm deletion:
de: Bitte gib den Namen der Umgebung ein, um die Löschung zu bestätigen:

source: Environment Name
de: Umgebungsname

# environmentDeleted
source: Environment "{name}" deleted successfully.
de: Umgebung "{name}" erfolgreich gelöscht.

# environmentNameMismatch
source: Environment name does not match. Please try again.
de: Der Name der Umgebung stimmt nicht überein. Bitte versuche es erneut.

# deleteEnvironmentError
source: Failed to delete environment: {error}
de: Fehler beim Löschen der Umgebung: {error}

# gettingEnvironments
source: Getting all environments...
de: Alle Umgebungen werden geladen...

# errorOccurred
source: Error: Something went wrong. Please try again later.
de: Fehler: Etwas ist schiefgelaufen. Bitte versuche es später erneut.

# noEnvironmentsFound
source: Hmm, seems like there’s no environment yet. Why don't you click here for a quick guide on how to start:
de: Hmm, es scheint noch keine Umgebung zu geben. Klick hier für eine kurze Anleitung, wie du anfangen kannst:

source: Getting Started
de: Erste Schritte

# addNewEnvironment
source: Add a new Aquatic Environment
de: Neue Wasserumgebung hinzufügen

# addPublicEnvironment
source: Add a publicly available Environment
de: Eine öffentlich verfügbare Umgebung hinzufügen

source: Fetching water values...
de: Wasserwerte werden abgerufen...

source: Fetching total entries...
de: Gesamteinträge werden abgerufen...

source: Loading complete!
de: Laden abgeschlossen!

source: Failed to load water values.
de: Fehler beim Laden der Wasserwerte.

source: No water values found.
de: Keine Wasserwerte gefunden.

source: Failed to load total entries.
de: Fehler beim Laden der Gesamteinträge.

source: No total entries found.
de: Keine Gesamteinträge gefunden.

# lineChartTitle
source: {parameterName} Levels over Time
de: {parameterName}-Werte über die Zeit

# xAxisLabel
source: Time
de: Zeit

# heatmapTitle
source: {parameterName} Level Heatmap
de: Heatmap der {parameterName}-Werte

# histogramTitle
source: Value Distribution
de: Verteilung in den letzten 24 Stunden

source: Getting all parameters...
de: Alle Parameter werden abgerufen...

# errorLoadingParameters
source: Error: There was an error loading the water parameters.
de: Fehler: Beim Laden der Wasserparameter ist ein Fehler aufgetreten.

# noParametersFound
source: No water parameters found.
de: Keine Wasserparameter gefunden.

# noParametersLast7Days
source: No water parameters found in the last 7 days. The data shown may be outdated.
de: Keine Wasserparameter in den letzten 7 Tagen gefunden. Die angezeigten Daten könnten veraltet sein.

# tabData
source: Data
de: Daten

# tabAlerts
source: Alerts
de: Warnungen

source: Ammonia
de: Ammoniak

# ammoniaInfo
source: Ammonia levels that are too high can be dangerous for your fish, leading to stress, illness, and even death. Ideally, ammonia levels should be kept at 0 ppm. An appropriate alert can be to notify when ammonia levels are above 0.1.
de: Zu hohe Ammoniakwerte können für Ihre Fische gefährlich sein, da sie Stress, Krankheiten und sogar den Tod verursachen können. Idealerweise sollten Ammoniakwerte bei 0 ppm gehalten werden. Eine geeignete Warnung könnte sein, wenn die Ammoniakwerte über 0,1 liegen.

source: Boron
de: Bor

# boronInfo
source: High levels of boron can be toxic to plants and invertebrates in your aquarium. It can also lead to stress and illness in sensitive fish species. An appropriate alert can be to notify when boron levels are above 1.0 ppm, depending on the species in your tank.
de: Hohe Borgehalte können für Pflanzen und Wirbellose in Ihrem Aquarium giftig sein. Es kann auch Stress und Krankheiten bei empfindlichen Fischarten verursachen. Eine geeignete Warnung könnte sein, wenn die Borgehalte über 1,0 ppm liegen, abhängig von den Arten in Ihrem Becken.

source: Bromine
de: Brom

# bromineInfo
source: Elevated bromine levels can be harmful to fish, leading to respiratory problems and stress. In extreme cases, it can be lethal. An appropriate alert can be to notify when bromine levels are above 0.1 ppm.
de: Erhöhte Bromgehalte können für Fische schädlich sein und zu Atemproblemen und Stress führen. In extremen Fällen kann es tödlich sein. Eine geeignete Warnung könnte sein, wenn die Bromgehalte über 0,1 ppm liegen.

source: Calcium
de: Kalzium

# calciumInfo
source: High calcium levels can lead to water hardness issues, which might cause stress in soft water fish. On the other hand, low calcium levels can lead to poor shell development in invertebrates. An appropriate alert can be to notify when calcium levels are above 450 ppm or below 300 ppm.
de: Hohe Kalziumwerte können zu Problemen mit der Wasserhärte führen, was bei Weichwasserfischen Stress verursachen kann. Niedrige Kalziumwerte können hingegen zu einer schlechten Schalentwicklung bei Wirbellosen führen. Eine geeignete Warnung könnte sein, wenn die Kalziumwerte über 450 ppm oder unter 300 ppm liegen.

source: Carbon Dioxide
de: Kohlendioxid

# carbonDioxideInfo
source: Excessive carbon dioxide (CO2) can lower the pH of your aquarium, leading to stress and respiratory issues in fish. In extreme cases, it can cause suffocation. An appropriate alert can be to notify when CO2 levels are above 30 ppm.
de: Überschüssiges Kohlendioxid (CO2) kann den pH-Wert Ihres Aquariums senken, was bei Fischen zu Stress und Atemproblemen führen kann. In extremen Fällen kann es zu Erstickung führen. Eine geeignete Warnung könnte sein, wenn die CO2-Werte über 30 ppm liegen.

source: Carbonate Hardness
de: Karbonathärte

# carbonateHardnessInfo
source: High carbonate hardness (KH) levels can cause pH stability issues, making it difficult to adjust pH levels. Low KH can lead to sudden pH swings, which are harmful to fish. An appropriate alert can be to notify when carbonate hardness is above 12 dKH or below 4 dKH.
de: Hohe Karbonathärte (KH) kann zu Problemen mit der pH-Stabilität führen, was die Einstellung des pH-Werts erschwert. Niedrige KH kann plötzliche pH-Schwankungen verursachen, die für Fische schädlich sind. Eine geeignete Warnung könnte sein, wenn die Karbonathärte über 12 dKH oder unter 4 dKH liegt.

source: Chloride
de: Chlorid

# chlorideInfo
source: High chloride levels can indicate contamination and may lead to stress in freshwater fish. An appropriate alert can be to notify when chloride levels are above 250 mg/L.
de: Hohe Chloridgehalte können auf Kontamination hinweisen und bei Süßwasserfischen zu Stress führen. Eine geeignete Warnung könnte sein, wenn die Chloridgehalte über 250 mg/L liegen.

source: Chlorine
de: Chlor

# chlorineInfo
source: Excess chlorine can be toxic to all aquatic life, leading to severe stress, gill damage, and death. An appropriate alert can be to notify when chlorine levels are detectable (above 0 ppm).
de: Überschüssiges Chlor kann für alle Wasserlebewesen giftig sein und zu starkem Stress, Kiemenschäden und Tod führen. Eine geeignete Warnung könnte sein, wenn Chlorwerte nachweisbar sind (über 0 ppm).

source: Conductivity
de: Leitfähigkeit

# conductivityInfo
source: High conductivity often indicates high levels of dissolved salts, which can be harmful to fish not adapted to such conditions. An appropriate alert can be to notify when conductivity exceeds 2000 µS/cm in freshwater aquariums.
de: Hohe Leitfähigkeit weist oft auf hohe Salzgehalte hin, die für Fische, die an solche Bedingungen nicht angepasst sind, schädlich sein können. Eine geeignete Warnung könnte sein, wenn die Leitfähigkeit in Süßwasseraquarien 2000 µS/cm überschreitet.

source: Copper
de: Kupfer

# copperInfo
source: Elevated copper levels can be highly toxic to invertebrates and sensitive fish species, leading to death. An appropriate alert can be to notify when copper levels exceed 0.1 ppm.
de: Erhöhte Kupferwerte können für wirbellose Tiere und empfindliche Fischarten hochgiftig sein und zum Tod führen. Eine geeignete Warnung könnte sein, wenn Kupferwerte 0,1 ppm überschreiten.

source: Fluoride
de: Fluorid

# fluorideInfo
source: High fluoride levels can be harmful to fish, causing stress and potential organ damage over time. An appropriate alert can be to notify when fluoride levels exceed 1.5 ppm.
de: Hohe Fluoridwerte können für Fische schädlich sein, Stress verursachen und mit der Zeit Organschäden hervorrufen. Eine geeignete Warnung könnte sein, wenn Fluoridwerte 1,5 ppm überschreiten.

source: General Hardness
de: Gesamthärte

# generalHardnessInfo
source: General hardness (GH) measures the total concentration of calcium and magnesium. Water that is too hard or too soft can stress fish and affect their osmoregulation. An appropriate alert can be to notify when GH is above 14 dGH or below 4 dGH, depending on the species.
de: Die Gesamthärte (GH) misst die Gesamtkonzentration von Kalzium und Magnesium. Wasser, das zu hart oder zu weich ist, kann Fische belasten und ihre Osmoregulation beeinträchtigen. Eine geeignete Warnung könnte sein, wenn die GH über 14 dGH oder unter 4 dGH liegt, je nach Art.

source: Iodine
de: Jod

# iodineInfo
source: Iodine is necessary for invertebrate health but in high concentrations, it can be toxic to both fish and invertebrates. An appropriate alert can be to notify when iodine levels are above 0.06 ppm.
de: Jod ist für die Gesundheit von Wirbellosen notwendig, kann aber in hohen Konzentrationen sowohl für Fische als auch für Wirbellose giftig sein. Eine geeignete Warnung könnte sein, wenn die Jodwerte über 0,06 ppm liegen.

source: Iron
de: Eisen

# ironInfo
source: High iron levels can lead to excessive algae growth and may be toxic to invertebrates and some fish species. An appropriate alert can be to notify when iron levels exceed 0.2 ppm.
de: Hohe Eisenwerte können zu übermäßigem Algenwachstum führen und für Wirbellose und einige Fischarten giftig sein. Eine geeignete Warnung könnte sein, wenn Eisenwerte 0,2 ppm überschreiten.

# magnesiumInfo
source: Magnesium is crucial for coral and invertebrate health, but excessive levels can disrupt water chemistry and harm aquatic life. An appropriate alert can be to notify when magnesium levels are above 1500 ppm.
de: Magnesium ist entscheidend für die Gesundheit von Korallen und Wirbellosen, aber übermäßige Mengen können die Wasserchemie stören und aquatisches Leben schädigen. Eine geeignete Warnung könnte sein, wenn Magnesiumwerte über 1500 ppm liegen.

source: Molybdenum
de: Molybdän

# molybdenumInfo
source: Molybdenum in excess can be toxic to fish and invertebrates, potentially leading to health issues or death. An appropriate alert can be to notify when molybdenum levels exceed 0.01 ppm.
de: Ein Überschuss an Molybdän kann für Fische und Wirbellose giftig sein und möglicherweise gesundheitliche Probleme oder den Tod verursachen. Eine geeignete Warnung könnte sein, wenn Molybdänwerte 0,01 ppm überschreiten.

source: Nitrate
de: Nitrat

# nitrateInfo
source: High nitrate levels can cause stress, weaken immune systems, and lead to algae overgrowth. An appropriate alert can be to notify when nitrate levels exceed 40 ppm.
de: Hohe Nitratwerte können Stress verursachen, das Immunsystem schwächen und zu übermäßigem Algenwachstum führen. Eine geeignete Warnung könnte sein, wenn Nitratwerte 40 ppm überschreiten.

source: Nitrite
de: Nitrit

# nitriteInfo
source: Nitrite is highly toxic to fish and even small amounts can lead to stress, illness, or death. An appropriate alert can be to notify when nitrite levels are detectable (above 0 ppm).
de: Nitrit ist hochgiftig für Fische, und selbst kleine Mengen können Stress, Krankheiten oder den Tod verursachen. Eine geeignete Warnung könnte sein, wenn Nitritwerte nachweisbar sind (über 0 ppm).

source: Organic Carbon
de: Organischer Kohlenstoff

# organicCarbonInfo
source: High levels of organic carbon can indicate poor water quality, leading to oxygen depletion and stress for fish. An appropriate alert can be to notify when organic carbon levels are above 5 mg/L.
de: Hohe Werte an organischem Kohlenstoff können auf eine schlechte Wasserqualität hinweisen, die zu Sauerstoffmangel und Stress bei Fischen führt. Eine geeignete Warnung könnte sein, wenn organische Kohlenstoffwerte über 5 mg/L liegen.

source: Oxygen
de: Sauerstoff

# oxygenInfo
source: Low oxygen levels can lead to suffocation and death for fish, especially those in densely stocked tanks. An appropriate alert can be to notify when oxygen levels drop below 5 mg/L.
de: Niedrige Sauerstoffwerte können zu Erstickung und Tod bei Fischen führen, insbesondere in dicht besetzten Aquarien. Eine geeignete Warnung könnte sein, wenn Sauerstoffwerte unter 5 mg/L fallen.

# phInfo
source: pH levels that are too high or too low can lead to stress, disease, and even death in fish. Different fish species require different pH levels. An appropriate alert can be to notify when pH levels are outside the range of 6.5 to 8.0, depending on species.
de: Zu hohe oder zu niedrige pH-Werte können Stress, Krankheiten und sogar den Tod bei Fischen verursachen. Verschiedene Fischarten benötigen unterschiedliche pH-Werte. Eine geeignete Warnung könnte sein, wenn die pH-Werte außerhalb des Bereichs von 6,5 bis 8,0 liegen, abhängig von der Art.

source: Phosphate
de: Phosphat

# phosphateInfo
source: Excess phosphate can lead to algae overgrowth, causing oxygen depletion and stress in fish. An appropriate alert can be to notify when phosphate levels exceed 1.0 ppm.
de: Überschüssiges Phosphat kann zu Algenwachstum führen, das Sauerstoff abbaut und Stress bei Fischen verursacht. Eine geeignete Warnung könnte sein, wenn Phosphatwerte über 1,0 ppm liegen.

source: Potassium
de: Kalium

# potassiumInfo
source: Potassium is necessary for plant health, but high levels can be harmful to fish and other aquatic life. An appropriate alert can be to notify when potassium levels exceed 30 ppm.
de: Kalium ist für die Pflanzengesundheit notwendig, aber hohe Werte können für Fische und andere aquatische Lebewesen schädlich sein. Eine geeignete Warnung könnte sein, wenn Kaliumwerte über 30 ppm liegen.

# redoxPotentialInfo
source: Redox potential that is too low can indicate poor water quality and lack of oxygen, while too high can cause oxidative stress in fish. An appropriate alert can be to notify when redox potential is outside the range of +200 to +400 mV.
de: Ein zu niedriges Redoxpotential kann auf schlechte Wasserqualität und Sauerstoffmangel hinweisen, während ein zu hohes oxidativen Stress bei Fischen verursachen kann. Eine geeignete Warnung könnte sein, wenn das Redoxpotential außerhalb des Bereichs von +200 bis +400 mV liegt.

source: Salinity
de: Salzgehalt

# salinityInfo
source: High salinity can cause osmotic stress in freshwater fish, leading to dehydration and death. An appropriate alert can be to notify when salinity is above 1.005 specific gravity in freshwater tanks.
de: Ein hoher Salzgehalt kann bei Süßwasserfischen osmotischen Stress verursachen, was zu Dehydrierung und Tod führen kann. Eine geeignete Warnung könnte sein, wenn der Salzgehalt über 1,005 spezifisches Gewicht in Süßwasseraquarien liegt.

source: Silica
de: Kieselsäure

# silicaInfo
source: Silica can promote diatom algae growth, which can be problematic in aquariums. An appropriate alert can be to notify when silica levels exceed 2 mg/L.
de: Kieselsäure kann das Wachstum von Kieselalgen fördern, was problematisch in Aquarien sein kann. Eine geeignete Warnung könnte sein, wenn die Kieselsäurewerte 2 mg/L überschreiten.

# strontiumInfo
source: Strontium is important for coral growth, but excessive levels can be harmful to invertebrates. An appropriate alert can be to notify when strontium levels exceed 12 ppm.
de: Strontium ist wichtig für das Korallenwachstum, aber übermäßige Mengen können für Wirbellose schädlich sein. Eine geeignete Warnung könnte sein, wenn Strontiumwerte 12 ppm überschreiten.

source: Sulfate
de: Sulfat

# sulfateInfo
source: Sulfate in high concentrations can contribute to water hardness and be toxic to fish and invertebrates. An appropriate alert can be to notify when sulfate levels exceed 500 mg/L.
de: Hohe Sulfatkonzentrationen können zur Wasserhärte beitragen und für Fische und Wirbellose giftig sein. Eine geeignete Warnung könnte sein, wenn Sulfatwerte 500 mg/L überschreiten.

source: Suspended Solids
de: Schwebstoffe

# suspendedSolidsInfo
source: High levels of suspended solids can cause cloudy water, reduce light penetration, and stress fish by clogging their gills. An appropriate alert can be to notify when suspended solids exceed 30 mg/L.
de: Hohe Schwebstoffwerte können das Wasser trüben, die Lichtdurchlässigkeit verringern und Fische durch Verstopfen der Kiemen stressen. Eine geeignete Warnung könnte sein, wenn die Schwebstoffwerte 30 mg/L überschreiten.

# tdsInfo
source: Total Dissolved Solids (TDS) that are too high can indicate poor water quality and stress aquatic life. An appropriate alert can be to notify when TDS levels exceed 500 ppm in freshwater aquariums.
de: Hohe Werte von gelösten Feststoffen (TDS) können auf eine schlechte Wasserqualität hinweisen und das Leben im Wasser belasten. Eine geeignete Warnung könnte sein, wenn die TDS-Werte in Süßwasseraquarien 500 ppm überschreiten.

source: Temperature
de: Temperatur

# temperatureInfo
source: Temperature that is too high or too low can cause thermal stress, weaken immune systems, and lead to death. Different species have different temperature requirements. An appropriate alert can be to notify when temperature is outside the range of 24-28°C, depending on species.
de: Zu hohe oder zu niedrige Temperaturen können thermischen Stress, ein geschwächtes Immunsystem und den Tod verursachen. Verschiedene Arten haben unterschiedliche Temperaturanforderungen. Eine geeignete Warnung könnte sein, wenn die Temperatur außerhalb des Bereichs von 24-28°C liegt, abhängig von der Art.

source: Turbidity
de: Trübung

# turbidityInfo
source: High turbidity can reduce light penetration, disrupt photosynthesis, and stress fish by clogging their gills. An appropriate alert can be to notify when turbidity exceeds 5 NTU.
de: Eine hohe Trübung kann die Lichtdurchlässigkeit verringern, die Photosynthese stören und Fische durch Verstopfen ihrer Kiemen belasten. Eine geeignete Warnung könnte sein, wenn die Trübung 5 NTU überschreitet.
